Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: བདག་གི་བག་ཆགས་ཀྱི་ས་ཡོངས་སུ་མི་འཛིན་པ་དང་། གཞན་མི་དམིགས་པ་དང་། སྲོག་ལ་རློམ་སེམས་མེད་པ་དང་། འཁོར་བ་ལ་མི་འཇུག་པ་དང་། དངོས་པོ་ཡོངས་སུ་ཤེས་པ་དང་ཞི་གནས་བསྒོམ་པ་དང་ལྷག་མཐོང་མངོན་སུམ་དུ་བྱེད་པ་དང་།
en: It is to no longer hold on to the habitual basis of a self. It is to no longer apprehend an other. It is to not think highly of one’s own life. It is to not enter saṃsāra. It is to understand all entities. It is to meditate on tranquility and to actualize special insight.

source: སེམས་གནས་པ་དང་དྲན་པ་མི་གཡེང་བ་དང་རྟོག་པ་དང་དཔྱོད་པ་ཉེ་བར་ཞི་བ་དང་།
en: It is to be stable minded and undistracted in mindfulness and to pacify notions and judgments.

source: དགེ་བའི་ཕྱོགས་ལ་ཡང་དག་པར་སྟེན་པ་དང་མི་དགེ་བའི་ཕྱོགས་སེལ་བ་དང་།
en: It is to keep company with virtue and to discard nonvirtue.

source: ཆགས་པ་དང་ཞེ་སྡང་དང་གཏི་མུག་རབ་ཏུ་ཞི་བ་དང་མ་རིག་པ་སེལ་བ་དང་རིག་པ་ལ་ཡང་དག་པར་སྟེན་པ་དང་།
en: It is to pacify attachment, aversion, and dullness, to dispense with ignorance, and to rely on knowing.

source: རྒྱུ་ཡོངས་སུ་ཤེས་པ་དང་ལྟ་བ་ཡང་དག་པར་འཇོམས་པ་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བ་དང་།
en: It is to understand causation, to demolish a view, and to be free from consciousness.

source: ཡེ་ཤེས་འབྱུང་བ་དང་སྲིད་པ་ཟད་པ་དང་དགའ་བའི་འདོད་ཆགས་སྤོང་བ་དང་སངས་རྒྱས་ལ་གཅིག་ཏུ་ངེས་པ་དང་ཆོས་ལ་ནེམ་ནུར་མེད་པ་དང་།
en: It is to arouse wisdom, to exhaust existence, to abandon attachment to joyful states, to be certain about buddhahood, and to have no doubt about the Dharma.

source: དགེ་འདུན་ལ་རྣམ་པར་མི་རྟོག་པ་དང་མི་འབྱེད་པའི་ཚིག་དང་འཐུན་པར་སྡུམས་བྱེད་པ་དང་།
en: It is to not be skeptical about the Saṅgha and to reconcile disputes arising from divisive speech.

source: དབེན་པ་ལ་གཞོལ་བ་དང་བཀའ་བློ་བདེ་བ་དང་མུ་ཅོར་དུ་མི་སྨྲ་བ་དང་ཟང་ཟིང་མེད་པ་དང་།
en: It is to adhere to solitude, to be adept in integrating the teachings, to not speak foolishly behind someone’s back, and to be without worldly goods.

source: ཁ་ན་མ་ཐོ་བ་སྤོང་བ་དང་སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པ་དང་འབྲེལ་པ་མདུན་དུ་བྱེད་པ་དང་།
en: It is to abandon what is naturally wrong and to not commit any negative actions,

source: འཕུབ་མི་བྱེད་པ་དང་འཇིག་རྟེན་གྱི་ཡ་མཚན་ལ་མངོན་པར་དགའ་བ་མེད་པ་དང་།
en: It is to not hoard things and to have no fascination with worldly wonders.

source: འཁོར་བ་ལ་ཉེས་དམིགས་སུ་ལྟ་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་ཕན་ཡོན་དུ་ལྟ་བ་དང་།
en: It is to see what is wrong with saṃsāra and what is beneficial in nirvāṇa.

source: ལྷག་པའི་བསམ་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་འདོད་པ་དང་།
en: It is to wish for the sphere of the transcendence of suffering with strong intent.

source: གཡོ་མེད་པ་དང་གྱ་གྱུ་མེད་པ་དང་སྒྱུ་མེད་པ་དང་། ཚུལ་འཆོས་པ་མེད་པ་དང་ཁ་གསག་མེད་པ་དང་། གཞོགས་སློང་མེད་པ་དང་། ཐོབ་ཀྱིས་འཇལ་བ་མེད་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་ཡོངས་སུ་སྤོང་བ་དང་།
en: “It is to be without deceit, dishonesty, and pretense. It is to avoid hypocrisy, fraud, hustling, expropriation, and disrespect.

source: བརྩོན་འགྲུས་བརྩམས་པ་དང་ཤིན་ཏུ་བཟོད་པ་དང་། ལེ་ལོ་མེད་པ་དང་སྒྲིབ་པ་སྤོང་བ་དང་།
en: It is to practice diligence and to be very patient. It is to not be lazy and to abandon obscurations.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་སྐྱོན་མེད་པ་དང་།
en: It is to be endowed with the path of the ten virtues and to have a faultless aggregate of discipline.

source: ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ལས་མི་གཡོ་བ་དང་།
en: It is to never depart from the aggregate of absorption.

source: ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་མི་གནས་པ་དང་
en: It is to never remain in the absorptions or the equipoises.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་མི་ངོམས་པ་དང་།
en: It is to be insatiable in bringing the perfections to completion.

source: བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པས་རྣམ་པར་འཕྲུལ་པ་དང་།
en: It is to create emanations through concentration, freedom, absorption, and equipoise.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པས་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་རྣམ་པར་རྩེན་པ་དང་།
en: It is to be free to play as one likes due to the bases of miraculous power.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དབང་སྒྱུར་བ་དང་།
en: It is to master omniscient wisdom.

source: བློ་ཐ་དད་པ་མེད་པ་དང་བེམས་པོ་མ་ཡིན་པ་དང་མི་འོན་མི་ལྐུགས་པ་དང་།
en: “It is to not be of two minds, nor to be inanimate or deaf or dumb.

source: གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་དང་ཀུན་ནས་མནར་སེམས་ཀྱི་དངོས་པོ་རྣམ་པར་སྤོང་བ་དང་།
en: It is to not be led into any other path. It is to abandon everything that torments the mind.

source: སྐྱེས་བུ་དམ་པའི་གནས་ཐོབ་པ་དང་སྐྱེས་བུ་ངན་པ་ལ་མི་ལྟ་བ་དང་བྱིས་པ་རྣམས་རྣམ་པར་སྤོང་བ་དང་
en: It is to attain the level of holy beings, to not consider unwholesome beings, and to disregard the spiritually immature.

source: མཁས་པ་དང་འགྲོགས་པ་དང་།
en: It is to associate with the learned.

source: དྲན་པའི་སྟོབས་བསྐྱེད་པ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་བསྐྱེད་པ་དང་།
en: It is to arouse the strength of mindfulness. It is to arouse the strength of wisdom.

source: ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་རྣམས་དང་མི་འདྲི་བ་དང་།
en: It is to have no need to seek clarification from householders or renunciates.

source: དབེན་པ་ལ་གནས་པ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། ཆོས་རྣམས་ལ་བཟོད་པ་དང་
en: “It is to remain in solitude. It is to have patience with regard to emptiness, the absence of marks, the absence of wishes, and all phenomena.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་པ་སྟེ། འདི་ནི་བཟང་སྐྱོང་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་སྟེ།
en: It is to understand all things as they are. This, Bhadrapāla, is the absorption called the miraculous ascertainment of peace.

source: ཏིང་ངེ་འཛིན་འདི་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པས་ཤེས་པ་འཐོབ་བོ།
en: Since bodhisattvas who train in this absorption are unobscured regarding all phenomena, they become knowledgeable.

source: །བཟང་སྐྱོང་གཞན་ཡང་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ།
en: “Furthermore, Bhadrapāla, this so-called absorption of the miraculous ascertainment of peace is as follows:

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་། ཚིག་ཐམས་ཅད་ལ་མཚམས་སྦྱར་བར་ཤེས་པ་དང་
en: It is to know all phenomena to be sameness. It is to know all words to be constructions.

source: ཁྱིམ་གྱི་དངོས་པོ་ཡོངས་སུ་གཏོང་བ་དང་། ཁམས་གསུམ་ལ་མངོན་པར་མི་དགའ་བ་དང་སེམས་མ་ཞུམ་པ་དང་།
en: It is to abandon all household goods. It is to find no delight in the three realms. It is to not be discouraged.

source: ཆོས་ཐམས་ཅད་ལ་མངོན་པར་མ་ཞེན་པ་དང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། ཆོས་སྦེད་པ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་དང་འདུལ་བ་ལ་མཁས་པ་དང་།
en: It is to not cling to any phenomenon. It is to uphold the sacred Dharma. It is to guard the Dharma. It is to have conviction in the ripening of actions. It is to be expert in training others.

source: རྩོད་པ་ཉེ་བར་ཞི་བ་དང་འཐབ་པ་མེད་པ་དང་། འགྱེད་པ་མེད་པ་དང་།
en: It is to pacify debate and to not engage in fighting. It is to not get involved in disputes.

source: བཟོད་པ་ཡང་དག་པར་འཛིན་པ་དང་། རྟོགས་པ་ཡང་དག་པར་འཛིན་པ་དང་།
en: It is to uphold patience authentically and to uphold realization authentically.

source: རྟོགས་པ་མཉམ་པ་ཉིད་དང་། ཆོས་ཉིད་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པ་དང་།
en: It is to be expert in distinguishing realization, sameness, and reality.

source: ཆོས་གཏན་ལ་དབབ་པ་ལ་མཁས་པ་དང་། ཆོས་ཀྱི་ཚིག་ལ་མཁས་པ་དང་། ཆོས་ཀྱི་ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་དང་།
en: “It is to be expert in ascertaining the Dharma. It is to be expert in expressions of the Dharma. It is to know how to distinguish expressions of the Dharma.

source: སྔོན་གྱི་མཐའ་ཤེས་པ་དང་། ཕྱི་མའི་མཐའ་ཤེས་པ་དང་། ད་ལྟར་བྱུང་བ་ཤེས་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་།
en: It is to know the past, the future, and the present. It is to know the three times to be sameness.

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཤེས་པ་དང་། ལུས་ཀྱི་གནས་ཤེས་པ་དང་། སེམས་ཀྱི་གནས་ཤེས་པ་དང་།
en: It is to know the utter purity of the three spheres. It is to know the basis of the body and the basis of the mind.

source: སྤྱོད་ལམ་སྲུང་བ་ཤེས་པ་དང་། ལས་རྣམ་པར་དག་པ་དང་། སྒྲིབ་པ་ལས་ཤིན་ཏུ་འདའ་བ་དང་།
en: “It is to know how to guard one’s mode of conduct. It is to purify one’s actions. It is to transcend obscurations.

source: ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་དང་། ཁམས་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དང་།
en: It is to thoroughly know the aggregates. It is to know the sameness of the elements.

source: སྐྱེ་མཆེད་སེལ་བ་དང་། སྲིད་པ་སྤོང་བ་དང་། མི་སྐྱེ་བའི་བཟོད་པའི་བྱ་བ་འཇུག་པ་དང་།
en: It is to dispel the sense sources. It is to discard existence. It is to endeavor in the task of accepting non-arising.

source: རྒྱུ་སྟོན་པ་དང་། ལས་དང་འབྲས་བུ་ཆུད་མི་གཟོན་པ་དང་།
en: It is to point out causes and to not dismiss actions and results.

source: ཆོས་མཐོང་བ་དང་ལམ་སྒོམ་པ་དང་།
en: It is to see the Dharma and cultivate the path.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་དང་ཕྲད་པ་དང་།
en: It is to meet with the thus-gone ones.

source: ཤེས་རབ་རྣོ་བ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་དང་། སྒྲ་ཡོངས་སུ་ཤེས་པ་དང་།
en: It is to have sharp insight. It is to know how to distinguish words. It is to understand speech.

source: མཆོག་ཏུ་དགའ་བ་ཐོབ་པ་དང་། ཆོས་ཀྱི་དགའ་བ་རྗེས་སུ་མྱོང་བ་དང་།
en: “It is to attain supreme delight. It is to experience the joy of the Dharma.

source: དྲན་པ་དང་། མཉེན་པ་དང་། ངང་བདེ་བ་དང་ཁྲོ་གཉེར་མེད་པ་དང་། དེས་པ་དང་འགྲོགས་ན་བདེ་བ་དང་ཚིག་འཇམ་པ་དང་།
en: It is to be mindful, gentle, blissful, unperturbed, good-natured, and easy to get along with.

source: གསོང་པོར་སྨྲ་བ་དང་ཚུར་ཤོག་ལེགས་པར་འོངས་སོ་ཞེས་སྨྲ་བ་དང་། སྙོམ་ལས་མེད་པ་དང་
en: It is to speak truthfully with gentle words and to say, ‘Come here.Welcome.’ It is to not be lazy.

source: བླ་མ་ལ་གུས་པ་དང་། བླ་མ་ལ་སྲི་ཞུ་ཆེ་བ་དང་
en: It is to be respectful of and honor spiritual masters.

source: སྐྱེ་བ་ལ་མི་དགའ་བ་དང་།
en: It is to not delight in birth.

source: ཆོས་དཀར་པོས་མི་ངོམས་པ་དང་འཚོ་བ་རྣམ་པར་དག་པ་དང་།
en: It is to be insatiable regarding virtuous qualities. It is to have a pure livelihood.

source: དགོན་པའི་གནས་མི་གཏོང་བ་དང་། ས་རྣམ་པར་འཇོག་པ་དང་། དྲན་པ་ཆུད་མི་གཟོན་པ་དང་
en: It is to not renounce remote places. It is to settle in a place. It is to not squander mindfulness.

source: ཕུང་པོ་ལ་མཁས་པ་དང་། ཁམས་ལ་མཁས་པ་དང་སྐྱེ་མཆེད་ལ་མཁས་པ་དང་། མངོན་པར་ཤེས་པ་མངོན་དུ་བྱ་བ་ལ་འཇུག་པ་དང་།
en: It is to be expert in the aggregates, elements, and sense sources. It is to engage in manifesting superknowledge.

source: ཉོན་མོངས་པ་སེལ་བ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡང་དག་པར་འཇོམས་པ་དང་།
en: It is to eliminate disturbing emotions. It is to defeat the binding force of habit.

source: ཁྱད་པར་དུ་འགྲོ་བ་དང་སྒོམ་པའི་རྒྱུ་འཐུན་པ་དང་། ལྟུང་བ་ལས་འབྱིན་པ་ལ་མཁས་པ་དང་།
en: “It is to have specific attainments and the natural result of meditation. It is to be expert in rescuing from the downfalls.

source: ཀུན་ནས་དཀྲིས་པ་རྣམ་པར་གནོན་པ་དང་། བག་ལ་ཉལ་བ་སྤོང་བ་དང་། སྲིད་པ་ལས་ཤིན་ཏུ་འདའ་བ་དང་།
en: It is to remove all that binds. It is to discard latent tendencies. It is to utterly transcend existence.

source: ཚེ་རབས་དྲན་པ་དང་།
en: It is to recall past lives.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཐེ་ཚོམ་མེད་པ་དང་།
en: It is to have no doubt about the ripening of actions.

source: ལས་ལ་སེམས་པ་དང་སྐྱེ་བ་ལ་ཡིད་མི་རྟོན་པ་དང་།
en: It is to contemplate karma.It is to not mentally rely on birth.

source: ལས་མངོན་པར་འདུ་མི་བྱེད་པ་དང་ནང་གི་སྐྱེ་མཆེད་ཡིད་ལ་མི་བྱེད་པ་དང་།
en: It is to not create karmic actions. It is to be without the mental activity of the inner sense sources.

source: ཕྱིའི་སྐྱེ་མཆེད་རྣམས་ལ་ཀུན་ཏུ་མི་རྒྱུ་བ་དང་།
en: It is to not move out toward the outer sense sources.

source: བདག་ལ་མི་སྟོད་པ་དང་གཞན་ལ་མི་སྨོད་པ་དང་།
en: It is to not praise oneself or belittle others.

source: མི་དགའ་བ་ལ་མི་ཞེན་པ་དང་སོ་སོའི་སྐྱེ་བོ་ལ་ཡིད་མི་རྟོན་པ་དང་།
en: It is to not cling to what is unpleasant. It is to not mentally rely on ordinary beings.

source: ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་དང་བསྙེན་པར་དཀའ་བ་དང་། གཟི་བརྗིད་ཆེ་བ་དང་བདག་ཤེས་པ་དང་ཉམས་པ་མེད་པ་དང་།
en: It is to be in accord with the cause of ethical conduct. “It is to be one who is rarely encountered. It is to be absolutely resplendent. It is to know oneself. It is to be uncorrupted.

source: སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་ལ་གནས་པ་དང་གནོད་སེམས་མེད་པ་དང་ཚིག་མི་བརླང་བ་དང་
en: It is to observe perfect behavior. It is to have no malice. It is to not use foul words.

source: གཞན་ལ་མི་གནོད་པ་དང་། མཛའ་བོ་རྗེས་སུ་སྲུང་བ་དང་རྣམ་པར་མི་འཚེ་བའི་ངང་ཚུལ་དང་ལྡན་པ་དང་།
en: It is to not harm others, to protect close ones, and to be naturally nonviolent.

source: སེམས་ཅན་ལ་གནོད་པ་མི་བྱེད་པ་དང་
en: It is to not harm beings.

source: ཚིག་འཇམ་པ་དང་།
en: It is to be gentle in speech.

source: ཁམས་གསུམ་པ་ལ་མི་གནས་པ་དང་
en: It is to not abide in the three realms.

source: གསང་བའི་ཚིག་རྣམས་སྲུང་བ་དང་།
en: It is to be able to keep secrets.

source: ཆོས་ཐམས་ཅད་ལ་སྟོང་པ་ཉིད་དང་འཐུན་པར་བཟོད་པ་དང་
en: It is to have acceptance in accord with the emptiness of all phenomena.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཤིན་ཏུ་འདུན་པ་དང་
en: It is to be greatly inspired toward omniscient wisdom.

source: ཡེ་ཤེས་གསལ་བ་དང་། ཚུལ་ཁྲིམས་བརྟན་པ་དང་སྙོམས་པར་འཇུག་པ་ལ་འཇུག་པ་དང་།
en: It is to have clear wisdom, to have stable discipline, and to be engaged in equipoise.

source: གཅིག་པུར་དགའ་བ་དང་
en: It is to be happy to be alone.

source: ཅུང་ཟད་ཤེས་པས་ཆོག་པར་མི་འཛིན་པ་དང་།
en: It is to not be content with knowing just a little bit.

source: སེམས་ཞུམ་པ་མེད་པ་དང་ལྟ་བར་གྱུར་པ་རྣམ་པར་སྤོང་བ་དང་།
en: It is to not be discouraged. It is to abandon all that constitutes a view.

source: གཟུངས་ཐོབ་པ་དང་ཡེ་ཤེས་ཐོབ་པ་དང་གནས་དང་གནས་མ་ཡིན་པ་ལ་ནན་ཏན་བྱེད་པ་དང་།
en: It is to achieve dhāraṇī and wisdom. It is to be meticulous about what is correct and what is incorrect.

source: གཏན་ཚིགས་དང་རིགས་པ་དང་ཚུལ་གྱི་སྒོར་གྱུར་པ་དང་།
en: It is to have an approach based on reason and logic.

source: འདོམས་པ་དང་རྗེས་སུ་སྟོན་པ་དང་སྤྱོད་པ་འཐུན་པར་བཟོད་པ་དང
en: It is to offer counsel. It is to be appropriately forbearing of conduct.

source: བཟོད་པའི་ས་དང་ལྡན་པ་དང་། མི་བཟོད་པ་མེད་པ་དང་
en: It is to have reached the level of acceptance.It is to not be unforbearing.

source: ཡེ་ཤེས་ཀྱི་ས་དང་ལྡན་པ་དང་། མི་ཤེས་པ་སྤོང་བ་དང་། ཡེ་ཤེས་ལ་གནས་པ་དང་། རྣལ་འབྱོར་སྤྱོད་པའི་ས་དང་།
en: It is to be on the level of wisdom. It is to abandon ignorance. It is to abide in wisdom. It is to be on the level of yogic conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་བ་དང་།
en: It is to have the sphere of activity of bodhisattvas.

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཁོང་དུ་ཆུད་ཅིང་རབ་ཏུ་རྟོགས་པ་ཤེས་པ་དང་
en: It is to understand the essence of all phenomena and know the highest realization.

source: སེམས་ངེས་པར་སེམས་པ་དང་།
en: It is to comprehend the mind.

source: སྐྱེ་བར་ཉིང་མཚམས་མི་སྦྱོར་བ་དང་ཉིང་མཚམས་མི་སྦྱོར་བ་ཤེས་པ་དང་
en: “It is to not reincarnate into a new birth. It is to know not to reincarnate.

source: ཁུར་བོར་བ་དང་།
en: It is to lay down the burden.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་
en: It is to have the wisdom of the thus-gone ones.

source: འདོད་ཆགས་སྤོང་བ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་གཏི་མུག་སྤོང་བ་དང་
en: It is to abandon attachment, to be free from anger, and to abandon dullness.

source: རྣལ་འབྱོར་ལ་བརྩོན་པ་དང་། མི་རིགས་པ་དང་བྲལ་བ་དང་།
en: It is to be diligent in practice. It is to be free from unreasonableness.

source: དགེ་བའི་ཆོས་ལ་འདུན་པ་དང་ལྷག་པའི་བསམ་པ་ལ་ནན་ཏན་བྱེད་པ་དང་
en: It is to be inspired toward virtuous phenomena. It is to put into practice the higher intention.

source: མཚན་མོ་མི་ཉལ་བ་དང་།
en: It is to not sleep the night away.

source: སྤོང་བ་མི་གཏོང་བ་དང་ཆོས་དཀར་པོ་རྣམས་ཀུན་དུ་སྲུང་བ་དང་།
en: It is to not give up on abandonment. It is to nurture virtuous qualities.

source: དགེ་བའི་རྩ་བ་སྔོན་དུ་འགྲོ་བ་དང་། ཐབས་ལ་མཁས་པ་ཤེས་པ་དང་མཚན་མ་སྤོང་བ་དང་
en: It is to have previously cultivated the roots of virtue. It is to know skill in means. It is to abandon marks.

source: འདུ་ཤེས་ལས་ལྡོག་པ་དང་།
en: It is to abstain from perception.

source: མདོ་སྡེ་མངོན་པར་སྒྲུབ་པ་དང་
en: It is to be accomplished in the discourses.

source: འདུལ་བ་ལ་མཁས་པ་དང་། བདེན་པ་ལ་རྣམ་པར་ངེས་པ་དང་
en: It is to be expert in the vinaya. It is to be certain about the truths.

source: རྣམ་པར་གྲོལ་བ་ལ་མངོན་སུམ་དུ་བྱ་བ་ལ་འཇུག་པ་དང་།
en: It is to endeavor in the actualization of liberation.

source: ཚིག་གཅིག་ཏུ་ངེས་པ་དང་། གཙིགས་པར་སྨྲ་བ་དང་
en: “It is to delight in words and speak with a smile.

source: ཡེ་ཤེས་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དང་།
en: It is to see wisdom as it is.

source: ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་དང་
en: It is to seek out learning.

source: ཡེ་ཤེས་ཀྱིས་མི་ངོམས་པ་དང་།
en: It is to never be satisfied with one's wisdom.

source: སེམས་ཡོངས་སུ་དག་པ་དང་། ལུས་ཡོངས་སུ་དག་པ་དང་། ངག་ཡོངས་སུ་དག་པ་དང་།
en: It is to have an utterly pure mind, an utterly pure body, and utterly pure speech.

source: དོགས་པ་མེད་པའི་ཚིག་དང་
en: It is to be trustworthy in speech.

source: སྟོང་པ་ཉིད་ལ་ཀུན་ཏུ་སྟེན་པ་དང་། མཚན་མ་མེད་པ་ལ་སྟེན་པ་དང་
en: It is to rely on emptiness. It is to rely on the absence of marks.

source: སྨོན་པ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་མི་དམིགས་པར་ཤེས་པ་དང་།
en: It is to know nonconceptually due to the nature of the absence of wishes.

source: མི་འཇིགས་པ་ཐོབ་པ་དང་
en: “It is to attain fearlessness.

source: སྡུག་བསྔལ་བ་རྣམས་ལ་མི་བརྙས་པ་དང་། དེ་དག་ལ་ནོར་སྦྱིན་པ་དང་དབུལ་པོ་རྣམས་ལ་ཁྱད་དུ་མི་གསོད་པ་དང་
en: It is to not abuse those who suffer and to give them wealth. It is to not be contemptuous of the poor.

source: ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་སྙིང་བརྩེ་ཞིང་སྙིང་རྗེ་བའི་བློ་དང་ལྡན་པ་དང་།
en: It is to care compassionately for those whose discipline is corrupted.

source: ཕན་པའི་དངོས་པོ་དང་ལྡན་པ་དང་
en: It is to be in possession of beneficial goods.

source: ཆོས་ཀྱིས་ཕན་འདོགས་པ་དང་།
en: It is to be of benefit through the Dharma.

source: ཟང་ཟིང་ཡོངས་སུ་གཏོང་བ་དང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་གཡོ་མེད་པར་སྟེན་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་།
en: It is to give up material things. It is to rely unwaveringly on those with discipline. It is to let go of all possessions.

source: ལྷག་པའི་བསམ་པས་མགྲོན་དུ་གཉེར་བ་དང་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་བྱེད་པ་དང་།
en: “It is to make offerings with a higher intention. It is to practice what one preaches.

source: ཕྱིར་ཞིང་བརྩོན་པ་དང་བསྟི་སྟང་བྱས་པས་དགའ་བ་མྱོང་བ་དང་།
en: It is to continuously endeavor. It is to take delight in being respectful.

source: དཔེ་ཤེས་པ་དང་སྔོན་བྱུང་བ་ལ་མཁས་པ་དང་།
en: It is to understand metaphors. It is to be knowledgeable about what has occurred in the past.

source: མིང་དང་བརྡར་བརྟགས་པ་ལ་འཇུག་པ་ཤེས་པ་དང་བཏགས་པ་ཀུན་ཏུ་འཇོམས་པ་དང་།
en: It is to know the application of names and terminology.It is to have destroyed imputation.

source: བཀུར་སྟི་བྱེད་པ་ལ་མངོན་པར་དགའ་བ་མེད་པ་དང་བཀུར་སྟི་མི་བྱེད་པ་ལ་བཏང་སྙོམས་སུ་བྱེད་པ་དང་།
en: “It is to not get overjoyed when being honored and to remain equanimous when being dishonored.

source: རྙེད་པ་དོན་དུ་མི་གཉེར་བ་དང་མ་རྙེད་པས་སྲོ་ཤི་བར་མི་འགྱུར་བ་དང་
en: It is to not be interested in gain or disheartened by loss.

source: གྲགས་པ་ལ་མངོན་པར་འདོད་པ་མེད་པ་དང་། མ་གྲགས་པ་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་
en: It is to have no desire for fame, and it is to not be angry when infamy befalls oneself.

source: བསྔགས་པ་ལ་རྗེས་སུ་ཆགས་པ་མེད་པ་དང་། སྨད་པ་ལ་སྤ་གོང་བར་མི་འགྱུར་བ་དང་
en: It is to not hanker after praise or be deflated by blame.

source: བདེ་བ་ལ་མངོན་པར་མི་ཆགས་པ་དང་། སྡུག་བསྔལ་གྱིས་མི་སྐྱོ་བ་དང་
en: It is to not be desirous of pleasure or saddened by pain.

source: འདུ་བྱེད་ཀུན་ཏུ་མི་འཛིན་པ་དང་།
en: “It is to not grasp after formations.

source: ཡང་དག་པའི་བསྔགས་པ་ལ་མི་ཆགས་པ་དང་ཡང་དག་པ་མ་ཡིན་པའི་བརྗོད་པ་དང་དུ་ལེན་པ་དང་།
en: It is to not desire proper commendation and to be accepting of false accusations.

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་དང་སྤྱོད་ཡུལ་ལ་འཇུག་པ་དང་།
en: It is to endeavor in one’s rightful domain and reject everything else.

source: ཆོ་ག་ཕུན་སུམ་ཚོགས་པ་དང་མི་ཚུལ་བ་རྣམ་པར་སྤོང་བ་དང་།
en: It is to abandon what is inappropriate.

source: སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བ་ཆུང་ངུ་ལ་མི་སྨོད་པ་དང་
en: It is to not downplay beings’ meagre roots of virtue.

source: བསྟན་པ་ཀུན་ཏུ་སྲུང་བ་དང་། སྨྲ་བ་ཉུང་བ་དང་མཉེན་པ་དང་སྐབས་ཀྱི་ཚིག་ལ་མཁས་པ་དང་།
en: It is to uphold the teaching. It is to be concise and gentle in speech. It is to be skilled in appropriate statements.

source: ཕྱིར་རྒོལ་བ་ཚར་གཅོད་པ་དང་དུས་སུ་འགྲོ་བ་དང་སྤྱོད་ལམ་བརྟགས་པ་མ་ཡིན་པ་དང་། སྤྱོད་ལམ་མཛེས་པ་དང
en: It is to defeat opponents. It is to come in time. It is to have conduct that is natural. It is to have conduct that is beautiful.

source: ་དོན་དང་དོན་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ་དང་། འཇིག་རྟེན་ཤེས་པ་དང་
en: “It is to be skilled in knowing what is meaningful and what is not. It is to know the world.

source: བསྟན་བཅོས་ཤེས་པ་དང་། གསལ་བར་སྨྲ་བ་དང་
en: It is to understand the treatises. It is to speak clearly.

source: ལག་རྐྱོང་བ་དང་སེམས་ཤིན་ཏུ་འཛིན་པ་དང་།
en: It is to give freely. It is to control the mind.

source: ཁྲེལ་ཡོད་པ་དང་ངོ་ཚ་ཤེས་པ་དང་
en: It is to have shame and conscience.

source: མི་དགེ་བའི་སེམས་ལ་སྨོད་པ་དང་
en: It is to denigrate nonvirtuous mind states.

source: སྦྱངས་པའི་ཡོན་ཏན་མི་གཏོང་བ་དང་
en: It is to not give up the qualities of an ascetic.

source: སྤྱོད་པ་ཡང་དག་པར་འཛིན་པ་དང་།
en: It is to properly uphold one’s conduct.

source: མཛེས་པར་ཀུན་ཏུ་རྒྱུ་བ་དང་
en: It is to move gracefully.

source: བླ་མ་ལ་ལྡང་བ་དང་སྟན་གདིང་བ་དང་། ང་རྒྱལ་ཚར་གཅོད་པ་དང་
en: “It is to rise for the master and prepare him a seat. It is to destroy pride.

source: སེམས་ཡང་དག་པར་འཛིན་པ་དང་།
en: It is to properly maintain the mind.

source: དོན་རབ་ཏུ་རྟོགས་པ་ཤེས་པ་དང་
en: It is to understand the meaning.

source: ཡེ་ཤེས་བསྐྱེད་པ་དང་
en: It is to have brought forth wisdom.

source: མི་ཤེས་པ་དང་བྲལ་བ་དང་སེམས་ལ་འཇུག་ཤེས་པ་དང་།
en: It is to be without ignorance. It is to know how to engage the mind.

source: སེམས་ཀྱི་ངོ་བོ་ཉིད་ཁོང་དུ་ཆུད་ཅིང་ཤེས་པ་དང་།
en: It is to understand and know the nature of mind.

source: སྒྲུབ་པ་དང་མི་བསྒྲུབ་པ་སྒྲུབ་པ་ལ་མཁས་པའི་ཡེ་ཤེས་དང་ལྡན་པ་དང་།
en: It is to possess the wisdom that is knowledgeable about all attainments, regardless of whether one has practiced them or not.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ཤེས་པ་དང་། ངེས་པའི་ཚིག་རྣམ་པར་གཞག་པ་ཤེས་པ་དང་དོན་རྣམ་པར་ངེས་པ་ཤེས་པ་དང་།
en: “It is to know the languages of all beings. It is to know how to establish etymologies and to know how to determine the meanings of words.

source: དོན་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་དང་།
en: It is to exclude what is not the real meaning.

source: བསམ་གཏན་རྣམས་སྒྲུབ་པ་དང་། དེ་དག་གི་རོ་མྱོང་བར་མི་བྱེད་པ་དང་
en: It is to accomplish all forms of concentration without savoring their experience.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་རྣམ་པར་ལྟ་ཞིང་སོ་སོར་རྟོག་པ་དང་།
en: “It is to see and consider the minds of each and every being.

source: སེམས་ཅན་གྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་དང་།
en: It is to know the superior and inferior faculties of beings.

source: གནས་དང་གནས་མ་ཡིན་པ་ལ་རྣམ་པར་ལྟ་བ་དང་།
en: It is to see what is appropriate and what is inappropriate.

source: ལས་ཐམས་ཅད་འབྱེད་པ་དང་། ལས་དང་རྣམ་པར་སྨིན་པ་མེད་པ་ལ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to discern all karmic actions. It is to know how to engage without karmic action and ripening.

source: མོས་པ་སྣ་ཚོགས་ལ་འཇུག་པ་དང་བརྗེད་ངས་པ་མེད་པ་དང་
en: It is to engage in manifold aspirations. It is to not be forgetful.

source: ཁམས་སྣ་ཚོགས་དང་། ཁམས་དུ་མ་མངོན་སུམ་དུ་གྱུར་པ་དང་
en: It is to have direct experience of the manifold and various realms.

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཀུན་ཏུ་མཐོང་བ་དང་།
en: “It is to see the vajra-like absorption.

source: ཚངས་པའི་དབྱངས་ཀྱིས་ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་རྩེན་པ་དང་།
en: It is to revel in absorption with a voice like Brahmā’s.

source: ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་གཅིག་པ་དང་། མིང་མེད་པ་དང
en: It is to know all states of absorption and equipoise to be the same and nameless.

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་དང་། ཀུན་ཏུ་འགྲོ་བའི་ལམ་ཤེས་པས་ལྟ་བ་དང་།
en: It is to remember past abodes. It is to see by knowing how to go everywhere.

source: ཟག་པ་ཟད་པ་དང་། སྤོང་བ་དུས་གཅིག་ཏུ་ཐོབ་པ་ཤེས་པ་དང་།
en: It is to have exhausted defilement. It is to know the simultaneous attainment of abandonment.

source: ལྷའི་མིག་ཐོགས་པ་མེད་པས་ལྟ་བ་དང་གཟུགས་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པས་རྣམ་པར་རྩེན་པ་དང་།
en: It is to see with the unimpeded divine eye. It is to enjoy manifesting all forms.

source: གཟུགས་དང་གཟུགས་མེད་པ་མཉམ་པ་ཉིད་དུ་འཇུག་པ་ཤེས་པ་དང་།
en: It is to know how to engage in form and the formless as sameness.
